GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
/*
 * dns_sink.cpp — ESP-IDF entry point for DNS sinkhole on LilyGO T-ETH-Elite
 *
 * W5500 Ethernet bringup for the T-ETH-Elite pin map (SPI2, event-group DHCP wait).
 */

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"

#include "esp_system.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_idf_version.h"
#include "esp_eth.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#include "esp_eth_mac_w5500.h"
#include "esp_eth_phy_w5500.h"
#endif
#if CONFIG_ADBLOCK_NET_WIFI
#include "esp_wifi.h"
#endif
#include "esp_netif.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "esp_mac.h"
#include "esp_timer.h"
#include "lwip/inet.h"

#include "driver/gpio.h"
#include "driver/spi_master.h"

#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdspi_host.h"
#include <inttypes.h>

#include "blocklist.h"
#include "domain.h"
#include "rewrite.h"
#include "acl.h"
#include "dot.h"
#include "query_log.h"
#include "timesync.h"
#include "dns_server.h"
#include "web_ui.h"
#include "mdns.h"
#include <cstring>
#include <cstdlib>
#include <cstdio>
#include <ctime>

static const char *TAG = "dns_sink";

/* ── SD card pin map: LilyGO T-ETH-ELITE S3 ─────────────────────── */
#define SD_MISO_GPIO  9
#define SD_MOSI_GPIO  11
#define SD_SCLK_GPIO  10
#define SD_CS_GPIO    12
#define SD_SPI_HOST   SPI3_HOST
#define SD_MOUNT      "/sdcard"

/* ── W5500 pin map: LilyGO T-ETH-ELITE S3 ──────────────────────── */
#define W5500_SCLK_GPIO  48
#define W5500_MISO_GPIO  47
#define W5500_MOSI_GPIO  21
#define W5500_CS_GPIO    45
#define W5500_INT_GPIO   14
#define W5500_RST_GPIO   -1
#define W5500_SPI_HOST   SPI2_HOST
/* SPI clock (MHz). W5500 is on GPIO-matrix pins (48/47/21/45), not the S3
 * IO_MUX FSPI pins (those are wired to the SD card), so the matrix MISO-sampling
 * delay caps it: 80 hard-fails w5500_reset. 60 is stable but measured IDENTICAL
 * latency/qps to 40 (per-query cost is transaction overhead, not clocking), so
 * we stay at the proven-safe 40 — what survives sustained full-duplex load. */
#define W5500_SPI_CLOCK  40

/* ── Event group ─────────────────────────────────────────────────── */
#define ETH_CONNECTED_BIT   BIT0
#define ETH_GOT_IP_BIT      BIT1
#define WIFI_CONNECTED_BIT  BIT2
#define WIFI_GOT_IP_BIT     BIT3
static EventGroupHandle_t s_eth_eg = nullptr;
static char               s_ip[16] = {};      /* Ethernet IP — the LAN-facing address, reported to clients/mDNS/web UI */
static char               s_gw[16] = {};      /* Ethernet DHCP gateway */
static char               s_eth_dns[16] = {}; /* Ethernet DHCP-provided DNS server (option 6) — the real upstream target */
#if CONFIG_ADBLOCK_NET_WIFI
static char               s_wifi_ip[16] = {};
static char               s_wifi_gw[16] = {};   /* Wi-Fi DHCP gateway */
static char               s_wifi_dns[16] = {};  /* Wi-Fi DHCP-provided DNS server — see s_eth_dns */
#endif

/* ── Global singletons ───────────────────────────────────────────── */
static DnsSinkServer s_dns;
static volatile bool s_reload_requested = false;

/* Called from web_ui.cpp POST /reload */
extern "C" void dns_sink_trigger_reload(void)
{
    s_reload_requested = true;
}

/* ── Dual-WAN upstream-interface selection (#53) ──────────────────────────
 * Which interface's gateway egresses upstream resolver queries (persisted in
 * NVS so it survives reboot). Listening on port 53 already happens on every
 * up interface (client socket binds INADDR_ANY) — this only steers the
 * *outbound* forwarding socket, via lwIP's subnet-based routing: sending to
 * a gateway IP that only one netif's subnet contains routes out that netif
 * automatically, no explicit interface binding needed. */
#define NVS_NS       "dns_sink"
#define NVS_KEY_UPIF "up_if"
static char s_upstream_iface[8] = "eth";   /* "eth" or "wifi" */

extern "C" bool dns_sink_wifi_built(void)
{
#if CONFIG_ADBLOCK_NET_WIFI
    return true;
#else
    return false;
#endif
}

/* Populate current interface IPs + active upstream selection for the web UI. */
extern "C" void dns_sink_net_status(char *iface, size_t iface_cap,
                                     char *eth_ip, size_t eth_cap,
                                     char *wifi_ip, size_t wifi_cap)
{
    if (iface) snprintf(iface, iface_cap, "%s", s_upstream_iface);
    if (eth_ip) snprintf(eth_ip, eth_cap, "%s", s_ip);
#if CONFIG_ADBLOCK_NET_WIFI
    if (wifi_ip) snprintf(wifi_ip, wifi_cap, "%s", s_wifi_ip);
#else
    if (wifi_ip && wifi_cap) wifi_ip[0] = '\0';
#endif
}

/* Recompute which resolver is the active upstream and push it live — no DNS
 * task restart, in-flight queries are unaffected (see DnsSinkServer::set_upstream).
 *
 * Upstream = the DHCP-provided DNS server (option 6) for the selected
 * interface, NOT its gateway. On a typical home router these are often the
 * same box, but on a mobile-hotspot/CGNAT connection (the Cox link this was
 * built for) they're not: the gateway is a bare NAT hop with no resolver at
 * all, while DHCP still hands out real, working DNS server IPs separately
 * (observed: gw 100.72.0.1 doesn't answer on :53; DNS servers 68.2.16.25/.30
 * do). Falls back to the gateway, then to 1.1.1.1, only if DHCP genuinely
 * didn't provide a DNS server. */
static const char *pick_upstream(const char *dns, const char *gw)
{
    if (dns[0] != '\0') return dns;
    if (gw[0]  != '\0') return gw;
    return "1.1.1.1";
}

static void apply_upstream_iface(void)
{
    const char *upstream = pick_upstream(s_eth_dns, s_gw);
#if CONFIG_ADBLOCK_NET_WIFI
    if (strcmp(s_upstream_iface, "wifi") == 0)
        upstream = pick_upstream(s_wifi_dns, s_wifi_gw);
#endif
    s_dns.set_upstream(upstream);
}

/* Called from web_ui.cpp POST /net/upstream. Returns false on an invalid or
 * unavailable (not built / not yet connected) interface — caller keeps the
 * previous setting in that case. */
extern "C" bool dns_sink_set_upstream_iface(const char *iface)
{
    if (!iface) return false;
    if (strcmp(iface, "eth") != 0
#if CONFIG_ADBLOCK_NET_WIFI
        && strcmp(iface, "wifi") != 0
#endif
    ) return false;

    snprintf(s_upstream_iface, sizeof(s_upstream_iface), "%s", iface);

    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READWRITE, &h) == ESP_OK) {
        nvs_set_str(h, NVS_KEY_UPIF, s_upstream_iface);
        nvs_commit(h);
        nvs_close(h);
    }
    apply_upstream_iface();
    return true;
}

