GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
static void upstream_iface_init_nvs(void)
{
#if CONFIG_ADBLOCK_NET_WIFI
    snprintf(s_upstream_iface, sizeof(s_upstream_iface), "wifi");  /* default when built dual-stack */
#endif
    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READONLY, &h) != ESP_OK) return;
    size_t len = sizeof(s_upstream_iface);
    nvs_get_str(h, NVS_KEY_UPIF, s_upstream_iface, &len);
    nvs_close(h);
}

/* ── Static IP vs DHCP (#55) ────────────────────────────────────────────
 * Applied only at boot — no live DHCP-client-state transition on a running
 * netif, which is the risky part (stopping/starting dhcpc mid-flight can
 * wedge the netif). Changing a form field here just persists to NVS; the
 * web UI's save action tells the user to reboot to apply, same as most
 * router admin panels handle this exact class of change. */
struct NetStaticCfg {
    bool dhcp = true;
    char ip[16]  = {};
    char nm[16]  = {};
    char gw[16]  = {};
    char dns[16] = {};
};

/* Loaded once at bring-up, then read by the link-up handlers to publish the
 * address at the right moment (see publish_static_eth/publish_static_wifi). */
static NetStaticCfg s_eth_static;

static void netcfg_load(const char *prefix, NetStaticCfg *cfg)
{
    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READONLY, &h) != ESP_OK) return;
    char key[24];
    uint8_t mode = 1;   /* default: DHCP */
    snprintf(key, sizeof(key), "%s_mode", prefix); nvs_get_u8(h, key, &mode);
    cfg->dhcp = (mode != 0);
    size_t len;
    len = sizeof(cfg->ip);  snprintf(key, sizeof(key), "%s_ip",  prefix); nvs_get_str(h, key, cfg->ip,  &len);
    len = sizeof(cfg->nm);  snprintf(key, sizeof(key), "%s_nm",  prefix); nvs_get_str(h, key, cfg->nm,  &len);
    len = sizeof(cfg->gw);  snprintf(key, sizeof(key), "%s_gw",  prefix); nvs_get_str(h, key, cfg->gw,  &len);
    len = sizeof(cfg->dns); snprintf(key, sizeof(key), "%s_dns", prefix); nvs_get_str(h, key, cfg->dns, &len);
    nvs_close(h);
}

/* Called from web_ui.cpp POST /net/{eth,wifi}/set. iface = "eth" or "wifi". */
extern "C" bool dns_sink_net_set_static(const char *iface, bool dhcp,
                                         const char *ip, const char *nm,
                                         const char *gw, const char *dns_ip)
{
    if (strcmp(iface, "eth") != 0 && strcmp(iface, "wifi") != 0) return false;
    if (!dhcp) {
        struct in_addr a;
        if (!ip || !inet_aton(ip, &a)) return false;
        if (!nm || !inet_aton(nm, &a)) return false;
        if (gw && gw[0] && !inet_aton(gw, &a)) return false;
        if (dns_ip && dns_ip[0] && !inet_aton(dns_ip, &a)) return false;
    }
    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READWRITE, &h) != ESP_OK) return false;
    char key[24];
    snprintf(key, sizeof(key), "%s_mode", iface); nvs_set_u8(h, key, dhcp ? 1 : 0);
    snprintf(key, sizeof(key), "%s_ip",   iface); nvs_set_str(h, key, ip ? ip : "");
    snprintf(key, sizeof(key), "%s_nm",   iface); nvs_set_str(h, key, nm ? nm : "");
    snprintf(key, sizeof(key), "%s_gw",   iface); nvs_set_str(h, key, gw ? gw : "");
    snprintf(key, sizeof(key), "%s_dns",  iface); nvs_set_str(h, key, dns_ip ? dns_ip : "");
    nvs_commit(h);
    nvs_close(h);
    return true;
}

/* Populate current NVS-stored config for the web UI form (not necessarily
 * what's active right now if it hasn't been rebooted since a change). */
extern "C" void dns_sink_net_get_static(const char *iface, bool *dhcp,
                                         char *ip, size_t ip_cap,
                                         char *nm, size_t nm_cap,
                                         char *gw, size_t gw_cap,
                                         char *dns_ip, size_t dns_cap)
{
    NetStaticCfg cfg;
    netcfg_load(iface, &cfg);
    if (dhcp) *dhcp = cfg.dhcp;
    if (ip)     snprintf(ip,     ip_cap,  "%s", cfg.ip);
    if (nm)     snprintf(nm,     nm_cap,  "%s", cfg.nm);
    if (gw)     snprintf(gw,     gw_cap,  "%s", cfg.gw);
    if (dns_ip) snprintf(dns_ip, dns_cap, "%s", cfg.dns);
}

extern "C" void dns_sink_reboot(void)
{
    esp_restart();
}

/* Stop the netif's DHCP client and push a static IP/netmask/gateway/DNS.
 * Must run before esp_eth_start()/esp_wifi_connect() — dhcpc_stop() on an
 * already-running client mid-connection is the unsupported transition that
 * risks wedging the netif; doing it here, before the link/radio is even up,
 * avoids that entirely. */
static void apply_static_ip(esp_netif_t *netif, const NetStaticCfg &cfg)
{
    esp_err_t rc = esp_netif_dhcpc_stop(netif);
    if (rc != ESP_OK && rc != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STOPPED)
        ESP_LOGW(TAG, "dhcpc_stop: %s", esp_err_to_name(rc));

    esp_netif_ip_info_t ipinfo = {};
    struct in_addr a;
    inet_aton(cfg.ip, &a); ipinfo.ip.addr = a.s_addr;
    inet_aton(cfg.nm, &a); ipinfo.netmask.addr = a.s_addr;
    if (cfg.gw[0]) { inet_aton(cfg.gw, &a); ipinfo.gw.addr = a.s_addr; }
    ESP_ERROR_CHECK(esp_netif_set_ip_info(netif, &ipinfo));

    if (cfg.dns[0]) {
        esp_netif_dns_info_t dns_info = {};
        dns_info.ip.type = ESP_IPADDR_TYPE_V4;
        inet_aton(cfg.dns, &a); dns_info.ip.u_addr.ip4.addr = a.s_addr;
        esp_netif_set_dns_info(netif, ESP_NETIF_DNS_MAIN, &dns_info);
    }
}

/* Publish a statically-configured interface's address — deferred to the
 * link-up event rather than done at config time (#56). A static netif never
 * fires IP_EVENT_*_GOT_IP, so the "got IP" bit has to be raised by hand; doing
 * it at config time (before esp_eth_start/esp_wifi_start) made app_main declare
 * the network ready and pin upstream DNS to the static gateway while the link
 * was still down — observed answering on 192.168.50.10 with the port empty,
 * which leaves every forwarded query timing out on an Ethernet-only build. */
static void publish_static_eth(void)
{
    if (s_eth_static.dhcp) return;
    snprintf(s_ip,      sizeof(s_ip),      "%s", s_eth_static.ip);
    snprintf(s_gw,      sizeof(s_gw),      "%s", s_eth_static.gw);
    snprintf(s_eth_dns, sizeof(s_eth_dns), "%s", s_eth_static.dns);
    ESP_LOGI(TAG, "Ethernet link up — static IP: %s  GW: %s  DNS: %s",
             s_ip, s_gw[0] ? s_gw : "(none)", s_eth_dns[0] ? s_eth_dns : "(none)");
    xEventGroupSetBits(s_eth_eg, ETH_GOT_IP_BIT);
    apply_upstream_iface();
}

/* ── Ethernet event handlers ─────────────────────────────────────── */
static void eth_event_handler(void *, esp_event_base_t, int32_t event_id, void *)
{
    if (event_id == ETHERNET_EVENT_CONNECTED) {
        xEventGroupSetBits(s_eth_eg, ETH_CONNECTED_BIT);
        publish_static_eth();      /* no-op under DHCP — the lease drives it instead */
    } else if (event_id == ETHERNET_EVENT_DISCONNECTED) {
        xEventGroupClearBits(s_eth_eg, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT);
        if (!s_eth_static.dhcp) { s_ip[0] = '\0'; s_gw[0] = '\0'; s_eth_dns[0] = '\0'; }
    }
}

/* Read the DHCP-provided DNS server (option 6) for a netif, if any. */
static void fetch_dhcp_dns(esp_netif_t *netif, char *out, size_t cap)
{
    esp_netif_dns_info_t dns{};
    if (esp_netif_get_dns_info(netif, ESP_NETIF_DNS_MAIN, &dns) == ESP_OK
        && dns.ip.type == ESP_IPADDR_TYPE_V4 && dns.ip.u_addr.ip4.addr != 0) {
        esp_ip4addr_ntoa(&dns.ip.u_addr.ip4, out, cap);
    } else {
        out[0] = '\0';
    }
}

static void ip_event_handler(void *, esp_event_base_t, int32_t event_id, void *event_data)
{
    if (event_id == IP_EVENT_ETH_GOT_IP) {
        auto *ev = static_cast<ip_event_got_ip_t *>(event_data);
        esp_ip4addr_ntoa(&ev->ip_info.ip, s_ip, sizeof(s_ip));
        esp_ip4addr_ntoa(&ev->ip_info.gw, s_gw, sizeof(s_gw));
        fetch_dhcp_dns(ev->esp_netif, s_eth_dns, sizeof(s_eth_dns));
        ESP_LOGI(TAG, "Ethernet IP: %s  GW: %s  DNS: %s", s_ip, s_gw, s_eth_dns[0] ? s_eth_dns : "(none)");
        xEventGroupSetBits(s_eth_eg, ETH_GOT_IP_BIT);
        apply_upstream_iface();
    }
#if CONFIG_ADBLOCK_NET_WIFI
    else if (event_id == IP_EVENT_STA_GOT_IP) {
        auto *ev = static_cast<ip_event_got_ip_t *>(event_data);
        esp_ip4addr_ntoa(&ev->ip_info.ip, s_wifi_ip, sizeof(s_wifi_ip));
        esp_ip4addr_ntoa(&ev->ip_info.gw, s_wifi_gw, sizeof(s_wifi_gw));
        fetch_dhcp_dns(ev->esp_netif, s_wifi_dns, sizeof(s_wifi_dns));
        ESP_LOGI(TAG, "Wi-Fi IP: %s  GW: %s  DNS: %s", s_wifi_ip, s_wifi_gw, s_wifi_dns[0] ? s_wifi_dns : "(none)");
        xEventGroupSetBits(s_eth_eg, WIFI_GOT_IP_BIT);
        apply_upstream_iface();
    }
#endif
}

