GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
#if CONFIG_ADBLOCK_NET_WIFI
/* ── Wi-Fi credentials: NVS-backed, Kconfig only as first-boot seed ──────
 * CONFIG_ADBLOCK_WIFI_SSID/PASSWORD used to be read directly at connect
 * time, which made the credentials permanently build-time-fixed. Runtime
 * reconfiguration (GUI network picker, #54) needs them in NVS instead; on
 * first boot (NVS empty) we seed from Kconfig once and persist that, so an
 * existing build's behavior is unchanged until someone actually reconfigures. */
static char s_wifi_ssid[33] = {};   /* 32 + NUL, per 802.11 max SSID length */
static char s_wifi_pass[65] = {};   /* 64 + NUL, per WPA2-PSK max */

static void wifi_creds_init_nvs(void)
{
    nvs_handle_t h;
    bool have_ssid = false;
    if (nvs_open(NVS_NS, NVS_READONLY, &h) == ESP_OK) {
        size_t len = sizeof(s_wifi_ssid);
        if (nvs_get_str(h, "wifi_ssid", s_wifi_ssid, &len) == ESP_OK && s_wifi_ssid[0] != '\0')
            have_ssid = true;
        len = sizeof(s_wifi_pass);
        nvs_get_str(h, "wifi_pass", s_wifi_pass, &len);
        nvs_close(h);
    }
    if (!have_ssid) {
        ESP_LOGI(TAG, "No Wi-Fi creds in NVS — seeding from Kconfig default");
        snprintf(s_wifi_ssid, sizeof(s_wifi_ssid), "%s", CONFIG_ADBLOCK_WIFI_SSID);
        snprintf(s_wifi_pass, sizeof(s_wifi_pass), "%s", CONFIG_ADBLOCK_WIFI_PASSWORD);
        if (nvs_open(NVS_NS, NVS_READWRITE, &h) == ESP_OK) {
            nvs_set_str(h, "wifi_ssid", s_wifi_ssid);
            nvs_set_str(h, "wifi_pass", s_wifi_pass);
            nvs_commit(h);
            nvs_close(h);
        }
    }
}

static NetStaticCfg s_wifi_static;

/* Wi-Fi counterpart of publish_static_eth — see that comment for why this is
 * deferred to association rather than done at config time (#56). */
static void publish_static_wifi(void)
{
    if (s_wifi_static.dhcp) return;
    snprintf(s_wifi_ip,  sizeof(s_wifi_ip),  "%s", s_wifi_static.ip);
    snprintf(s_wifi_gw,  sizeof(s_wifi_gw),  "%s", s_wifi_static.gw);
    snprintf(s_wifi_dns, sizeof(s_wifi_dns), "%s", s_wifi_static.dns);
    ESP_LOGI(TAG, "Wi-Fi associated — static IP: %s  GW: %s  DNS: %s",
             s_wifi_ip, s_wifi_gw[0] ? s_wifi_gw : "(none)",
             s_wifi_dns[0] ? s_wifi_dns : "(none)");
    xEventGroupSetBits(s_eth_eg, WIFI_GOT_IP_BIT);
    apply_upstream_iface();
}

/* Suppresses the STA_DISCONNECTED auto-retry across a deliberate reconfigure
 * (set_creds below), so it can't race the new credentials in with the old.
 * Cleared on association rather than synchronously after set_config: the
 * disconnect is asynchronous, so clearing it inline left the handler free to
 * fire its own connect alongside ours (#58). The deadline is a safety net —
 * if the new network never associates, normal auto-retry must resume rather
 * than stay suppressed forever. */
static volatile bool    s_wifi_reconfiguring   = false;
static volatile int64_t s_wifi_recfg_until_us  = 0;

static bool wifi_reconfig_active(void)
{
    if (!s_wifi_reconfiguring) return false;
    if (esp_timer_get_time() > s_wifi_recfg_until_us) {
        s_wifi_reconfiguring = false;      /* expired — resume normal retries */
        return false;
    }
    return true;
}

/* ── Wi-Fi STA bring-up (roadmap #49 slice, extended for concurrent dual-WAN
 * with Ethernet under #53 — both interfaces stay up together rather than
 * one replacing the other). */
static void wifi_event_handler(void *, esp_event_base_t, int32_t event_id, void *)
{
    if (event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_id == WIFI_EVENT_STA_DISCONNECTED) {
        xEventGroupClearBits(s_eth_eg, WIFI_CONNECTED_BIT | WIFI_GOT_IP_BIT);
        if (!s_wifi_static.dhcp) { s_wifi_ip[0] = '\0'; s_wifi_gw[0] = '\0'; s_wifi_dns[0] = '\0'; }
        if (wifi_reconfig_active()) {
            ESP_LOGI(TAG, "Wi-Fi disconnected (reconfiguring — not auto-retrying)");
        } else {
            ESP_LOGW(TAG, "Wi-Fi disconnected — retrying");
            esp_wifi_connect();
        }
    } else if (event_id == WIFI_EVENT_STA_CONNECTED) {
        s_wifi_reconfiguring = false;      /* reconfigure landed */
        xEventGroupSetBits(s_eth_eg, WIFI_CONNECTED_BIT);
        publish_static_wifi();             /* no-op under DHCP — the lease drives it */
    }
}

static void wifi_init_sta(void)
{
    wifi_creds_init_nvs();
    ESP_LOGI(TAG, "Wi-Fi STA: connecting to SSID \"%s\"", s_wifi_ssid);

    esp_netif_t *wifi_netif = esp_netif_create_default_wifi_sta();

    wifi_init_config_t init_cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&init_cfg));

    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                               wifi_event_handler, nullptr));

    /* Static IP (#55): the netif has to be configured before the driver starts
     * (see apply_static_ip), but the address is only *published* once the STA
     * actually associates — publish_static_wifi, from the event handler (#56). */
    netcfg_load("wifi", &s_wifi_static);
    if (!s_wifi_static.dhcp)
        apply_static_ip(wifi_netif, s_wifi_static);

    wifi_config_t wifi_cfg = {};
    strlcpy(reinterpret_cast<char *>(wifi_cfg.sta.ssid),
            s_wifi_ssid, sizeof(wifi_cfg.sta.ssid));
    strlcpy(reinterpret_cast<char *>(wifi_cfg.sta.password),
            s_wifi_pass, sizeof(wifi_cfg.sta.password));
    wifi_cfg.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_cfg));
    ESP_ERROR_CHECK(esp_wifi_start());
}

/* ── Wi-Fi scan + reconfigure from the web UI (#54) ──────────────────── */

extern "C" void dns_sink_wifi_get_ssid(char *out, size_t cap)
{
    snprintf(out, cap, "%s", s_wifi_ssid);
}

/* Blocking scan (esp_wifi_scan_start(..., true)) — runs in the caller's task
 * (httpd), taking a few seconds. That stalls the web UI request, not DNS
 * service, which is an acceptable tradeoff for an on-demand admin action. */
#define WIFI_SCAN_MAX 20
extern "C" int dns_sink_wifi_scan(char *out, size_t cap)
{
    wifi_scan_config_t scan_cfg = {};
    esp_err_t rc = esp_wifi_scan_start(&scan_cfg, true /* block until done */);
    if (rc != ESP_OK)
        return snprintf(out, cap, "{\"error\":\"scan failed (%d)\"}", (int)rc);

    uint16_t ap_num = 0;
    esp_wifi_scan_get_ap_num(&ap_num);
    if (ap_num > WIFI_SCAN_MAX) ap_num = WIFI_SCAN_MAX;
    static wifi_ap_record_t recs[WIFI_SCAN_MAX];
    uint16_t got = ap_num;
    esp_wifi_scan_get_ap_records(&got, recs);

