GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    /* SD-over-SPI init is occasionally flaky (ESP_ERR_INVALID_RESPONSE on the
     * probe). Retry a few times before giving up and falling back to download. */
    for (int attempt = 1; attempt <= 4; attempt++) {
        rc = esp_vfs_fat_sdspi_mount(SD_MOUNT, &host, &slot, &mcfg, &s_sd_card);
        if (rc == ESP_OK) {
            ESP_LOGI(TAG, "SD mounted (attempt %d): %lluMB", attempt,
                     (uint64_t)s_sd_card->csd.capacity * s_sd_card->csd.sector_size / (1024*1024));
            return;
        }
        ESP_LOGW(TAG, "SD mount attempt %d/4 failed: %s", attempt, esp_err_to_name(rc));
        vTaskDelay(pdMS_TO_TICKS(250));
    }
    ESP_LOGW(TAG, "SD mount failed after retries — no SD cache");
    spi_bus_free(SD_SPI_HOST);
}

/* ── Blocklist download task (Core 0, priority 2) ────────────────── */
static void download_task(void *)
{
    /* Boot: try SD cache first for instant blocking. If present, DO NOT
     * re-download on every boot — it wastes ~230s of bandwidth and opens a
     * sort null-window. The daily-reload timer (or manual /reload) refreshes. */
    bool from_sd = blocklist_load_sd();
    if (!from_sd) {
        ESP_LOGI(TAG, "No SD cache — downloading blocklist...");
        /* Retry with backoff (#57). blocklist_load() returns the domain count,
         * so 0 means the fetch failed; that used to be discarded, leaving the
         * sinkhole with an empty list — every query ALLOWED, silently — until
         * the next 4h reload. Most boot failures are just the network not being
         * ready yet, so a few spaced retries recover without waiting hours. */
        static const int retry_delay_s[] = { 15, 60, 300 };
        if (blocklist_load() == 0) {
            for (size_t i = 0; i < sizeof(retry_delay_s) / sizeof(retry_delay_s[0]); i++) {
                ESP_LOGW(TAG, "Boot blocklist download failed — retry %u/%u in %ds",
                         (unsigned)(i + 1),
                         (unsigned)(sizeof(retry_delay_s) / sizeof(retry_delay_s[0])),
                         retry_delay_s[i]);
                vTaskDelay(pdMS_TO_TICKS(retry_delay_s[i] * 1000));
                if (blocklist_load() > 0) break;
            }
            if (blocklist_domain_count() == 0)
                ESP_LOGE(TAG, "Blocklist still empty after retries — NOT blocking "
                              "until the next 4h reload or a manual /reload");
        }
    } else {
        ESP_LOGI(TAG, "SD cache active (%" PRIu32 " domains) — skipping boot refresh",
                 blocklist_domain_count());
    }
    ESP_LOGI(TAG, "download_task stack hwm: %u bytes free",
             (unsigned)uxTaskGetStackHighWaterMark(NULL));

    /* Reload every 4h on a fixed cadence. Scheduling itself stays on the
     * monotonic esp_timer (immune to NTP re-sync jumps — see L3, where an
     * absolute-wall-clock "sleep then reload" loop drifted); NTP wall-clock
     * (timesync_epoch()) is used only to log a real timestamp, once synced.
     * Use an absolute deadline advanced by exactly one interval each cycle
     * (next += interval) so the download/sort duration never pushes the
     * schedule later. A manual /reload fires immediately without shifting it. */
    const int64_t interval_us = 4LL * 60 * 60 * 1000000;  /* 4h */
    int64_t next_us = esp_timer_get_time() + interval_us;
    for (;;) {
        int64_t now_us = esp_timer_get_time();
        if (now_us >= next_us) {
            if (timesync_is_synced()) {
                time_t epoch = (time_t)timesync_epoch();
                char ts[32]; struct tm tmv; gmtime_r(&epoch, &tmv);
                strftime(ts, sizeof(ts), "%Y-%m-%d %H:%M:%S UTC", &tmv);
                ESP_LOGI(TAG, "4h reload (%s)...", ts);
            } else {
                ESP_LOGI(TAG, "4h reload (clock not yet synced)...");
            }
            blocklist_load();
            next_us += interval_us;
            if (next_us <= esp_timer_get_time())     /* fell behind — catch up */
                next_us = esp_timer_get_time() + interval_us;
            continue;
        }
        if (s_reload_requested) {
            s_reload_requested = false;
            ESP_LOGI(TAG, "Manual reload...");
            blocklist_load();   /* does not shift the daily deadline */
            continue;
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* ── L2 fast-path RX hook ────────────────────────────────────────────
 * Overrides the eth driver's stack-input. Blocked DNS A/AAAA queries are
 * answered here (craft frame + esp_eth_transmit) WITHOUT touching lwIP —
 * removing the ~1.5ms socket/stack overhead from the sinkhole hot path.
 * Everything else passes through to lwIP unchanged (DHCP, httpd, forwarding,
 * cache, allowed queries). Runs single-threaded in the eth RX task. */
static uint32_t s_l2_blocked = 0;   /* L2-handled blocked queries (bypassed lwIP) */
static uint32_t s_l2_cached  = 0;   /* L2-handled forward-cache hits (bypassed lwIP) */
extern "C" uint32_t dns_sink_l2_blocked(void) { return s_l2_blocked; }
extern "C" uint32_t dns_sink_l2_cached(void)  { return s_l2_cached; }

/* Parse question qname → normalized name; return qend offset within DNS msg. */
static int l2_qname(const uint8_t *dns, int dns_len, char *out, size_t cap, size_t *outlen)
{
    static char raw[256];
    int off = 12; size_t rl = 0;
    while (off < dns_len && dns[off] != 0) {
        uint8_t l = dns[off];
        if ((l & 0xC0) == 0xC0) return -1;              /* no compression in question */
        if (l & 0xC0) return -1;                        /* #42: reserved label type */
        if (off + 1 + l > dns_len || rl + l + 1 >= sizeof(raw)) return -1;
        if (rl) raw[rl++] = '.';
        memcpy(raw + rl, dns + off + 1, l); rl += l; off += 1 + l;
    }
    if (off >= dns_len) return -1;
    off++;                                               /* null label */
    if (off + 4 > dns_len) return -1;                    /* qtype + qclass */
    size_t nl = domain_normalize(out, cap, raw, rl);
    if (!nl) return -1;
    *outlen = nl;
    return off + 4;
}

