GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
static esp_err_t l2_input_cb(esp_eth_handle_t h, uint8_t *buf, uint32_t len,
                             void *priv, void *info)
{
    (void)info;
    static uint8_t  tx[600];
    static char     name[256];
    do {
        if (len < 14 + 20 + 8 + 13) break;               /* min IPv4/UDP/DNS */
        if (buf[12] != 0x08 || buf[13] != 0x00) break;   /* IPv4 only */
        int ihl = (buf[14] & 0x0F) * 4;
        if (ihl < 20 || buf[14 + 9] != 17) break;        /* UDP only */
        int udp = 14 + ihl;
        if (udp + 8 > (int)len) break;
        if (((buf[udp + 2] << 8) | buf[udp + 3]) != 53) break;   /* dst port 53 */
        int dns = udp + 8, dns_len = (int)len - dns;
        if (dns_len < 12) break;
        if (buf[dns + 2] & 0x80) break;                  /* must be a query (QR=0) */
        if (((buf[dns + 4] << 8) | buf[dns + 5]) != 1) break;    /* qdcount==1 */
        size_t nlen = 0;
        int qend = l2_qname(buf + dns, dns_len, name, sizeof(name), &nlen);
        if (qend < 0) break;
        uint16_t qtype = (buf[dns + qend - 4] << 8) | buf[dns + qend - 3];
        if (qtype != 1 && qtype != 28) break;            /* A / AAAA only */
        if (!blocklist_is_blocked_nb(name, nlen)) {      /* not blocked → try L2 cache, else lwIP */
            /* Forward-cache hit answered straight from L2, skipping lwIP — the
             * same socket-stack overhead the blocked path already bypasses. Lay
             * the eth+ip+udp headers into tx, then the seqlock-protected reader
             * copies the cached DNS reply right after them. Miss/race → lwIP. */
            int clen = dns_cache_l2_get(domain_hash(name, nlen), qtype,
                                        tx + dns, (int)sizeof(tx) - dns);
            if (clen <= 0) break;                        /* miss/expired/race → lwIP */
            memcpy(tx, buf, dns);                         /* eth+ip+udp headers */
            uint8_t s6[6]; memcpy(s6,tx,6); memcpy(tx,tx+6,6); memcpy(tx+6,s6,6);            /* swap MAC */
            uint8_t s4[4]; memcpy(s4,tx+14+12,4); memcpy(tx+14+12,tx+14+16,4); memcpy(tx+14+16,s4,4); /* swap IP */
            uint8_t s2[2]; memcpy(s2,tx+udp,2); memcpy(tx+udp,tx+udp+2,2); memcpy(tx+udp+2,s2,2);     /* swap ports */
            tx[dns] = buf[dns]; tx[dns+1] = buf[dns+1];   /* patch txid to this query */
            int iptot_c = ihl + 8 + clen;
            tx[14+2]=(iptot_c>>8); tx[14+3]=(iptot_c&0xFF);
            int udplen_c = 8 + clen;
            tx[udp+4]=(udplen_c>>8); tx[udp+5]=(udplen_c&0xFF);
            tx[udp+6]=0; tx[udp+7]=0;                     /* zero UDP checksum (legal IPv4) */
            tx[14+10]=0; tx[14+11]=0;                     /* IP checksum */
            uint32_t csum=0;
            for (int i=0;i<ihl;i+=2) csum += (tx[14+i]<<8)|tx[14+i+1];
            while (csum>>16) csum=(csum&0xFFFF)+(csum>>16);
            uint16_t cks=~csum; tx[14+10]=(cks>>8); tx[14+11]=(cks&0xFF);
            esp_eth_transmit(h, tx, dns + clen);
            s_l2_cached++;
            free(buf);                                    /* consumed (== eth_l2_free) */
            return ESP_OK;
        }

        /* ── craft blocked response in tx ── */
        int rdlen = (qtype == 28) ? 16 : 4;
        int dns_resp = qend + 12 + rdlen;                /* question + answer RR */
        int frame = dns + dns_resp;
        if (frame > (int)sizeof(tx)) break;
        memcpy(tx, buf, dns + qend);                     /* eth+ip+udp+dns(hdr+question) */
        uint8_t t6[6];
        memcpy(t6, tx, 6); memcpy(tx, tx + 6, 6); memcpy(tx + 6, t6, 6);          /* swap MAC */
        uint8_t t4[4];
        memcpy(t4, tx+14+12, 4); memcpy(tx+14+12, tx+14+16, 4); memcpy(tx+14+16, t4, 4); /* swap IP */
        uint8_t t2[2];
        memcpy(t2, tx+udp, 2); memcpy(tx+udp, tx+udp+2, 2); memcpy(tx+udp+2, t2, 2);     /* swap ports */
        { uint16_t qf = (buf[dns+2] << 8) | buf[dns+3];
          uint16_t rf = dns_resp_flags(qf, 0);
          tx[dns+2] = (rf >> 8); tx[dns+3] = (rf & 0xFF); }
        tx[dns+6] = 0; tx[dns+7] = 1;                    /* ancount=1 */
        tx[dns+8] = 0; tx[dns+9] = 0; tx[dns+10] = 0; tx[dns+11] = 0;  /* ns/ar=0 */
        uint8_t *a = tx + dns + qend;
        a[0]=0xC0; a[1]=0x0C; a[2]=(qtype>>8); a[3]=(qtype&0xFF);
        a[4]=0; a[5]=1; a[6]=0; a[7]=0; a[8]=0; a[9]=10;             /* class IN, ttl 10 */
        a[10]=(rdlen>>8); a[11]=(rdlen&0xFF);
        memset(a+12, 0, rdlen);                          /* 0.0.0.0 / :: */
        int iptot = ihl + 8 + dns_resp;
        tx[14+2]=(iptot>>8); tx[14+3]=(iptot&0xFF);
        int udplen = 8 + dns_resp;
        tx[udp+4]=(udplen>>8); tx[udp+5]=(udplen&0xFF);
        tx[udp+6]=0; tx[udp+7]=0;                        /* zero UDP checksum (legal IPv4) */
        tx[14+10]=0; tx[14+11]=0;                        /* IP checksum */
        uint32_t sum=0;
        for (int i=0;i<ihl;i+=2) sum += (tx[14+i]<<8)|tx[14+i+1];
        while (sum>>16) sum=(sum&0xFFFF)+(sum>>16);
        uint16_t csum=~sum;
        tx[14+10]=(csum>>8); tx[14+11]=(csum&0xFF);

        esp_eth_transmit(h, tx, frame);
        s_l2_blocked++;
        free(buf);                                       /* we consumed it (== eth_l2_free) */
        return ESP_OK;
    } while (0);

    return esp_netif_receive((esp_netif_t *)priv, buf, len, NULL);
}

/* ── app_main ────────────────────────────────────────────────────── */
extern "C" void app_main(void)
{
    /* NVS */
    esp_err_t r = nvs_flash_init();
    if (r == ESP_ERR_NVS_NO_FREE_PAGES || r == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        r = nvs_flash_init();
    }
    ESP_ERROR_CHECK(r);

    /* Event loop + netif */
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_ERROR_CHECK(esp_netif_init());

    s_eth_eg = xEventGroupCreate();

    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, ESP_EVENT_ANY_ID,
                                               ip_event_handler, nullptr));

